{
  "id": "healthy-air-fryer-turkey-meatballs-with-zoodles",
  "title": "Healthy Air Fryer Turkey Meatballs with Zoodles",
  "day": "",
  "description": "A delicious and healthy meal featuring turkey meatballs cooked in an air fryer, served with spiralized zucchini noodles.",
  "link": "https://www.foodnetwork.com/recipes/food-network-kitchen/healthy-air-fryer-turkey-meatballs-with-zoodles-9483246",
  "sections": [
    {
      "title": "🛒 Quick Ingredient Checklist",
      "type": "categorized-ingredients",
      "items": {
        "freezer": [],
        "refrigerator": [
          "1 1/2 pounds zoodles (spiralized zucchini noodles, from about 3 medium zucchinis)",
          "8 ounces ground turkey",
          "1/4 cup whole milk",
          "1/4 cup ricotta"
        ],
        "pantry": [
          "Kosher salt",
          "1/3 cup plain breadcrumbs",
          "2 tablespoons chopped fresh parsley",
          "1 tablespoon finely grated Parmesan, plus more for serving",
          "1/2 teaspoon dried oregano",
          "Freshly ground black pepper",
          "1 1/4 cups jarred tomato sauce"
        ],
        "other": []
      }
    },
    {
      "title": "👩‍🍳 Recipe",
      "type": "steps",
      "items": [
        "Toss the zoodles with a good pinch of salt in a large bowl. Let sit until the zoodles begin to soften and release some excess liquid, about 10 minutes. Pat them dry and set aside.",
        "Meanwhile, combine the breadcrumbs and milk in a medium bowl and let sit while the breadcrumbs soften and absorb most of the liquid, about 5 minutes.",
        "Add the turkey, ricotta, parsley, Parmesan, oregano, 1/2 teaspoon salt and several grinds of pepper to the breadcrumb mixture, then mix thoroughly with your hands to combine. Form into 12 meatballs (each about 1 1/2 tablespoons and 1 inch wide).",
        "Preheat an air fryer to 400 degrees F. Add the meatballs, leaving some space between each for air circulation. Air fry until golden brown on the outside and just cooked through, about 10 minutes, turning the meatballs about halfway through the cooking time.",
        "Meanwhile, warm the tomato sauce in a medium saucepan set over medium heat. Add the meatballs to the sauce, lower the heat to low and keep warm.",
        "Season the zoodles with a 1/4 teaspoon salt and several grinds of pepper. Air fry at 400 degrees F, tossing halfway through, until tender and starting to brown at the edges, 5 to 6 minutes.",
        "Divide the zoodles between 2 dinner plates or shallow bowls, then top each with 6 meatballs and spoon the warm tomato sauce over top. Serve with a sprinkle of Parmesan."
      ]
    },
    {
      "title": "🍽️ Estimated Nutrition (Per Serving)",
      "type": "list",
      "items": [
        "Calories: ~350",
        "Protein: ~30g",
        "Carbohydrates: ~20g",
        "Fat: ~15g"
      ]
    }
  ]
}