{
  "title": "Chipotle Bowl Copycat Recipe",
  "day": "",
  "description": "This recipe outlines how to make the essential elements of a Chipotle bowl. You can choose your favorite protein and toppings to customize it.",
  "link": "https://www.chipotle.com/",
  "sections": [
    {
      "title": "Quick Ingredient Checklist",
      "type": "checklist",
      "items": [
        "Pantry: Long-grain white rice",
        "Pantry: Bay leaf (optional)",
        "Pantry: Olive oil",
        "Pantry: Salt",
        "Pantry: Black beans (canned)",
        "Pantry: Cumin",
        "Pantry: Dried oregano",
        "Pantry: Pepper",
        "Pantry: Adobo sauce (from chipotle peppers)",
        "Pantry: Chili powder",
        "Pantry: Garlic powder",
        "Pantry: Onion powder",
        "Refrigerator: Butter or oil",
        "Refrigerator: Chicken thighs or breasts",
        "Produce: Lime",
        "Produce: Fresh cilantro",
        "Produce: Red onion",
        "Produce: Garlic",
        "Produce: Tomatoes",
        "Produce: Jalapeño peppers",
        "Produce: Avocados",
        "Optional: Shredded Monterey Jack cheese",
        "Optional: Sour cream or Greek yogurt",
        "Optional: Lettuce"
      ]
    },
    {
      "title": "Ingredients",
      "type": "ingredients",
      "items": [
        "For the Cilantro-Lime Rice:",
        "1 cup long-grain white rice (Basmati or Jasmine recommended)",
        "2 cups water",
        "1 bay leaf (optional)",
        "1 tablespoon butter or oil",
        "1/2 teaspoon salt",
        "Juice of 1 large lime",
        "1/4 cup chopped fresh cilantro",
        "For the Black Beans:",
        "1 (15 ounce) can black beans, rinsed and drained",
        "1 tablespoon olive oil",
        "1/4 cup chopped red onion",
        "1 clove garlic, minced",
        "1/2 teaspoon cumin",
        "1/4 teaspoon dried oregano",
        "Salt and pepper to taste",
        "2-3 tablespoons water or chicken/vegetable broth",
        "For the Chicken (Copycat Chipotle Chicken):",
        "1.5 lbs boneless, skinless chicken thighs or breasts",
        "2 tablespoons adobo sauce from a can of chipotle peppers in adobo",
        "1 tablespoon olive oil",
        "1 teaspoon chili powder",
        "1 teaspoon cumin",
        "1/2 teaspoon dried oregano",
        "1/2 teaspoon garlic powder",
        "1/4 teaspoon onion powder",
        "Salt and pepper to taste",
        "For the Pico de Gallo:",
        "1.5 cups chopped fresh tomatoes (Roma orDesired)",
        "1/2 cup finely chopped red onion",
        "1/4 cup chopped fresh cilantro",
        "1-2 jalapeño peppers, finely minced (seeds removed for less heat)",
        "Juice of 1 lime",
        "Salt to taste",
        "For the Guacamole:",
        "2 ripe avocados",
        "1/4 cup finely chopped red onion",
        "2 tablespoons chopped fresh cilantro",
        "1 clove garlic, minced (optional)",
        "Juice of 1/2 lime",
        "Salt to taste",
        "Optional Toppings:",
        "Shredded Monterey Jack cheese",
        "Sour cream or Greek yogurt",
        "Roasted Chili-Corn Salsa (requires additional ingredients and steps)",
        "Lettuce"
      ]
    },
    {
      "title": "Instructions",
      "type": "steps",
      "items": [
        "1. Make the Cilantro-Lime Rice:\nRinse the rice under cold water until the water runs clear.\nIn a medium saucepan, combine the rinsed rice, water, bay leaf (if using), butter or oil, and salt.\nBring to a boil, then reduce heat to low, cover, and simmer for 15-20 minutes, or until the water is absorbed and the rice is tender.\nRemove from heat and let stand, covered, for 5 minutes.\nDiscard the bay leaf. Fluff the rice with a fork.\nStir in the fresh lime juice and chopped cilantro. Keep warm.",
        "2. Prepare the Black Beans:\nHeat olive oil in a small saucepan over medium heat.\nAdd chopped red onion and cook until softened, about 3-4 minutes.\nAdd minced garlic, cumin, and oregano and cook for 30 seconds until fragrant.\nStir in the rinsed black beans, salt, and pepper.\nAdd the water or broth and bring to a simmer.\nCook for 5-7 minutes, stirring occasionally, until the beans are heated through and the flavors have melded. You can mash some of the beans against the side of the pan for a creamier texture if desired. Keep warm.",
        "3. Cook the Chipotle Chicken:\nIf using chicken breasts, you can pound them slightly to an even thickness for faster cooking. Cut the chicken into bite-sized pieces.\nIn a bowl, combine the adobo sauce, olive oil, chili powder, cumin, oregano, garlic powder, onion powder, salt, and pepper.\nAdd the chicken pieces to the marinade and toss to coat evenly. Marinate for at least 15 minutes, or up to a few hours in the refrigerator.\nHeat a skillet or grill pan over medium-high heat. Add the marinated chicken in a single layer, making sure not to overcrowd the pan.\nCook the chicken for 5-7 minutes per side, or until cooked through and slightly charred. The internal temperature should reach 165°F (74°C).\nRemove from heat and let rest for a few minutes before serving.",
        "4. Make the Pico de Gallo:\nIn a medium bowl, combine the chopped tomatoes, red onion, cilantro, and minced jalapeño.\nAdd the lime juice and salt to taste. Stir gently to combine.\nLet sit for at least 10 minutes for the flavors to meld.",
        "5. Prepare the Guacamole:\nIn a bowl, mash the ripe avocados with a fork to your desired consistency.\nStir in the chopped red onion, cilantro, and minced garlic (if using).\nAdd the lime juice and salt to taste.\nMix gently to combine.",
        "6. Assemble Your Bowl:\nStart with a base of cilantro-lime rice in your bowl.\nAdd a portion of the black beans and chipotle chicken.\nTop with generous dollops of pico de gallo and guacamole.\nAdd any optional toppings you like, such as cheese, sour cream, or corn salsa."
      ]
    }
  ],
  "id": "chipotle-bowl-copycat-recipe"
}